run/burningCylinderSupersonic2D_H2Air_Global/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          multicomponentShockFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8e-6;   // start with upwind scheme
// endTime         2e-3;   // continue with 2nd order scheme

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   1e-6;

purgeWrite      100;

writeFormat     binary; //ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.3;

maxDeltaT       1;

// ************************************************************************* //
