run/burningCylinderSupersonic2D_H2Air_Global/system/blockMeshDict.big
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// xmin -0.04;
// xmax  0.15;
// ymin -0.07;
// ymax  0.07;
// zmin -0.001;
// zmax  0.001;

// xmin -0.04;
// xmax  0.10;
// ymin -0.05;
// ymax  0.05;
// zmin -0.001;
// zmax  0.001;

xmin -0.1;
xmax  0.3;
// xmax  0.012;
ymin -0.1;
ymax  0.1;
zmin -0.001;
zmax  0.001;

// xcells 30;
// ycells 20;
zcells 1;

dx 0.0005;
dy 0.0005;
// dz 0.5;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
// lz #calc "$zmax - $zmin";

xcells #calc "round(mag(($lx)/($dx)))";
ycells #calc "round(mag(($ly)/($dy)))";
// zcells #calc "round(mag(($lz)/($dz)))";

vertices        
(
    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges           
(
);

/*
patches         
(
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch maxY 
    (
        (3 7 6 2)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )
);
*/

boundary        
(
    minX
    {
        type patch;
	faces
	( 
            (0 4 7 3)
	);
    }

    maxX
    {
        type patch;
	faces
	( 
            (2 6 5 1)
	);
    }

    minY
    {
        type patch;
	faces
	( 
            (1 5 4 0)
	);
    }

    maxY 
    {
        type patch;
	faces
	( 
            (3 7 6 2)
	);
    }

    minZ
    {
        type patch;
	faces
	( 
            (0 3 2 1)
	);
    }

    maxZ
    {
        type patch;
	faces
	( 
            (4 5 6 7)
	);
    }

);

mergePatchPairs 
(
);

// ************************************************************************* //
