run/burningCylinderSupersonic2D_H2Air_Global/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    surfaceMesh
    {
        type triSurfaceMesh;
        name cylinder_stlSurface;

        file    "surfacemesh.stl";
    }

    // refinementBox
    // {
    //     // type searchableBox;
    //     type box;
    //     min (-0.01 -0.01 -1e5);
    //     max ( 0.01  0.01  1e5);
    // }

    // refinementBoxYTop
    // {
    //     // type searchableBox;
    //     type box;
    //     min ( 0.005  0.006  -1e5 );
    //     max ( 1e5    1e5     1e5 );
    // }

    // refinementBoxYBottom
    // {
    //     // type searchableBox;
    //     type box;
    //     min ( 0.005  -1e5   -1e5 );
    //     max ( 1e5    -0.006  1e5 );
    // }
    

};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    maxLocalCells 100000;

    maxGlobalCells 2000000;

    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 2;

    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    features
    (
        {
            file "surfacemesh.eMesh";
            // level 0;
            level 4;
        }
    );

    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    refinementSurfaces
    {
        cylinder_stlSurface
        {
            level (2 2);
            //level (2 4);
        }

/*
        selection1
        {
            level (4 4);
        }
*/
    }

    // Feature angle:
    resolveFeatureAngle 30;		//recommended
    // resolveFeatureAngle 60;		//To avoid too much refinement with curvature		

    planarAngle 30;

    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    refinementRegions
    {
        refinementBox
        {
            mode inside;        	// inside - outside
            levels ((1 1));     	// min max

            //mode distance;        	// 
            //levels ((0.1 1));     	//first number distance normal to the surface in both direction
        }

        refinementBoxYTop
        {
            mode inside;        	// inside - outside
            levels ((1 1));     	// min max
        }

        refinementBoxYBottom
        {
            mode inside;        	// inside - outside
            levels ((1 1));     	// min max
        }
    }

    // Mesh selection
    // ~~~~~~~~~~~~~~

    locationInMesh (0.01 0.008 0.000153); 

    allowFreeStandingZoneFaces true;

}

// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;	//recommended
    //nSmoothPatch 10;	//improved

    tolerance 2.0;
    //tolerance 1.0;

    nSolveIter 30;	//recommended
    //nSolveIter 100;	//improved

    nRelaxIter 5;	//recommended
    //nRelaxIter 10;	//improved	10-20-50

    // Feature snapping

        nFeatureSnapIter 10;	//recommended
        //nFeatureSnapIter 100;	//improved	20-50-100

        implicitFeatureSnap false;

        explicitFeatureSnap true;

        multiRegionFeatureSnap false;

}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    // Layer thickness specification. This can be specified in one of following
    // ways:
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness
    // - overall thickness and expansionRatio

    // Expansion factor for layer mesh
    //expansionRatio 1.0;
    expansionRatio 1.2;

    finalLayerThickness 0.5;

    //firstLayerThickness 0.1;

    //thickness 0.5

    minThickness 0.1;

    layers
    {
        cylinder_stlSurface 
        {
            nSurfaceLayers 5;	//10
        }

//can add refinement locally
/*
        maxY
        {
            nSurfaceLayers 1;
            // Per patch layer data
            expansionRatio      1.3;
            finalLayerThickness 0.3;
            minThickness        0.1;
        }
*/

        // Disable any mesh shrinking and layer addition on any point of
        // a patch by setting nSurfaceLayers to 0
/*
        frozenPatches
        {
            nSurfaceLayers 0;
        }
*/
    }


    nGrow 0;

    // Advanced settings

    // Static analysis of starting mesh

        //featureAngle 0;		//no inflation
        featureAngle 130;		//recommended
        //featureAngle 330;		//improved

        maxFaceThicknessRatio 0.5;

        nSmoothSurfaceNormals 1;

        nSmoothThickness 10;

        minMedianAxisAngle 90;

        maxThicknessToMedialRatio 0.3;

        nSmoothNormals 3;

        slipFeatureAngle 30;

        nRelaxIter 5;

        nBufferCellsNoExtrude 0;

        nLayerIter 50;

        nRelaxedIter 20;
}

// Generic mesh quality settings. At any undoable phase these determine where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        // Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 75;
    }

    //minFlatness 0.5;

    // Advanced

        // Number of error distribution iterations
        nSmoothScale 4;
        // amount to scale back displacement at error points
        errorReduction 0.75;
}

// Advanced

//// Debug flags

debugFlags
(
    //mesh            // write intermediate meshes
    //intersections   // write current mesh intersections as .obj files
    //featureSeeds    // write information about explicit feature edge
                    // refinement
    //attraction      // write attraction as .obj files
    //layerInfo       // write information about layers
);


//
//// Write flags

// writeFlags
// (
//     scalarLevels    // write volScalarField with cellLevel for postprocessing
//     layerSets       // write cellSets, faceSets of faces in layer
//     layerFields     // write volScalarField for layer coverage
// );

mergeTolerance 1e-6;

// ************************************************************************* //
