run/burningCylinderSupersonic2D_H2Air_Global/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------

\*---------------------------------------------------------------------------*/

reactions
{
    h2AirReaction
    {
        type     irreversibleArrhenius;
        reaction "H2 + 0.5O2 = H2O";
        // reaction "H2^1 + 0.5O2^1 = H2O";
        // reaction "H2^1 + 0.5O2^1 = H2O^0";
        A        9.87e8;
        beta     0;
        // Ta       14906;
        Ea       3.1e7 [J/kmol];
    }
}

// ************************************************************************* //
