run/burningCylinderSupersonic2D_H2Air_Global/0.Closed/N2.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

Y_N2_init       0.7603;   // equivalence ratio = 0.3
// Y_N2_init       0.7559;   // equivalence ratio = 0.5
// Y_N2_init       0.74512;   // equivalence ratio = 1
internalField   uniform  $Y_N2_init;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    #include "${FOAM_CASE}/0/bcParams"

    inlet
    {
        // type            zeroGradient;

        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        
        // type            waveTransmissive;
        // fieldInf        $Y_N2_init;
        // $waveTransmissiveParams;
    }

    wallsY
    {
        type            zeroGradient;

        // type            waveTransmissive;
        // fieldInf        $Y_N2_init;
        // $waveTransmissiveParams;
    }

    cylinder
    {
        type            zeroGradient;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
