run/burningCylinderSupersonic2D_H2Air_Global/0.Closed/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

TInlet          600;
internalField   uniform $TInlet;

boundaryField
{
    #include "${FOAM_CASE}/0/bcParams"

    inlet
    {
        // type            zeroGradient;

        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        // type            inletOutlet;
        // value           $internalField;

        // type            zeroGradient;

        type            waveTransmissive;
        fieldInf        $TInlet;
        $waveTransmissiveParams;

        // type            advective;  // this gives problem when flame approaches a boundary
        // fieldInf        300;
        // $waveTransmissiveParams;
    }

    wallsY
    {
        type            zeroGradient;

        // type            waveTransmissive;
        // fieldInf        $TInlet;
        // $waveTransmissiveParams;

        // type            advective;  // this gives problem when flame approaches a boundary
        // fieldInf        300;
        // $waveTransmissiveParams;
    }

    cylinder
    {
        // type            zeroGradient;

        type            fixedValue;
        value           uniform 1800;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
