run/burningCylinderSupersonic2D_H2Air_Global/0.Closed/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

Y_init          0.0;
internalField   uniform $Y_init;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    #include "${FOAM_CASE}/0/bcParams"

    inlet
    {
        // type            zeroGradient;

        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;

        // type            waveTransmissive;
        // fieldInf        $Y_init;
        // $waveTransmissiveParams;
    }

    wallsY
    {
        type            zeroGradient;
        
        // type            waveTransmissive;
        // fieldInf        $Y_init;
        // $waveTransmissiveParams;
    }

    cylinder
    {
        type            zeroGradient;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
