run/burningCylinderSupersonic2D_H2Air_Global/Allmesh.big
#!/bin/bash -e
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

paraFoam -builtin -touch

runApplication blockMesh -dict blockMeshDict.big

runApplication surfaceConvert -scale 0.015 constant/geometry/surfacemesh_ref.stl constant/geometry/surfacemesh.stl

runApplication surfaceFeatures

runApplication snappyHexMesh -dict snappyHexMeshDict.big

runApplication extrudeMesh

runApplication createPatch

runApplication checkMesh -latestTime

# runApplication transformPoints "scale=(0.1 0.1 0.1)"

# ----------------------------------------------------------------- end-of-file
